In [2]:
import pandas as pd
import numpy as np

In [6]:
df= pd.DataFrame({'key1':['a','a','b','b','a'],'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})

In [7]:
df

  key1 key2     data1     data2
0    a  one -0.949209  0.713485
1    a  two -0.235441 -0.670702
2    b  one  0.933735 -2.734160
3    b  two  0.155128  1.681675
4    a  one -0.916799 -1.460434

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.933004
      two    -0.235441
b     one     0.933735
      two     0.155128
Name: data1, dtype: float64

### Iterating Over Groups

In [11]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.949209  0.713485
1    a  two -0.235441 -0.670702
4    a  one -0.916799 -1.460434
b
  key1 key2     data1     data2
2    b  one  0.933735 -2.734160
3    b  two  0.155128  1.681675

In [12]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.949209  0.713485
 1    a  two -0.235441 -0.670702
 4    a  one -0.916799 -1.460434,
 'b':   key1 key2     data1     data2
 2    b  one  0.933735 -2.734160
 3    b  two  0.155128  1.681675}

In [13]:
grouped = df.groupby(df.dtypes,axis=1)

In [16]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.949209  0.713485
1 -0.235441 -0.670702
2  0.933735 -2.734160
3  0.155128  1.681675
4 -0.916799 -1.460434
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [17]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [18]:
s_grouped

In [19]:
type(df)

pandas.core.frame.DataFrame

### grouping with dicts and series

In [39]:
people=pd.DataFrame(np.random.randn(5,5), columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [41]:
people

               a         b         c         d         e
Joe    -1.191007 -2.157419 -1.559047  0.491750 -1.574974
Steve   0.131100  0.538308  1.215034 -0.517732 -0.677083
Wes     0.771929  1.862198 -0.468610  0.561098 -0.287481
Jim    -0.952223 -0.813787 -0.539327 -0.187589  1.456992
Travis  0.969685  0.607033 -1.808538 -0.660248  0.372539

In [25]:
people.iloc[0:1]

            a         b         c         d        e
Joe -0.128326 -1.804679  0.866143 -1.700212 -0.34372

In [50]:
people.iloc[2:3,[1,2]]

            b        c
Wes  1.862198 -0.46861

In [51]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [52]:
map_series=pd.Series(mapping)

In [53]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [56]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [62]:
df.groupby(['key2']).sum()

         data1     data2
key2
one  -0.932272 -3.481108
two  -0.080312  1.010973

In [63]:
df.groupby('key2').sum()

         data1     data2
key2
one  -0.932272 -3.481108
two  -0.080312  1.010973